----------------------------------------------------------------------------------------------------------------------
-- НАСТРОЙКИ:
----------------------------------------------------------------------------------------------------------------------

	---------------------------------------
	-- Аккаунт
	---------------------------------------

	FILE_SETTINGS_TRADE_ACC							= "SPBFUT00211"; -- Торговый счет
	FILE_SETTINGS_CLIENT_CODE						= "SPBFUT00211"; -- Код клиента

	---------------------------------------
	-- Список торгуемых инструментов
	---------------------------------------
	
	FILE_SETTINGS_LIST_TICKETS = {
		{ "RIM0", 400 },	-- 2 значение деф. стоп-лосс
		{ "SiM0", 50 },		-- 2 значение деф. стоп-лосс
		{ "SRM0", 60 },		-- 2 значение деф. стоп-лосс
		{ "GZM0", 40 },		-- 2 значение деф. стоп-лосс
		{ "VBM0", 50 },		-- 2 значение деф. стоп-лосс
		{ "MNM0", 100 },	-- 2 значение деф. стоп-лосс
	};

	---------------------------------------
	-- Риск-менеджмент (элементы)
	---------------------------------------
	
	-- TODO::В следующих версиях риск-менеджер будет переработан
	FILE_SETTINGS_LIST_RM = {
		{ "_QuikRM1", 2 }, 			-- Лимит потерь капитала на 1 день в "%" от депозита
		{ "_QuikRM2", 0.6 }, 		-- Лимит потерь в 1 сделке в "%" от депозита
		{ "_QuikRM3", 25 }, 		-- Максимальная загрузка депозита в % от депозита
		-- { "_QuikRM4", 0.2 }, 	-- Минимальный размер стопа в "%" от стоимости инструмента
		{ "_QuikRM5", 3 } 			-- Лимит транзакций в день (кол-во)
	};

	---------------------------------------
	-- Паттерны
	---------------------------------------
	
	FILE_SETTINGS_LIST_PATTERN = {
		"Паттерн №1",
		"Паттерн №2",
		"Паттерн №3"
	};



