----------------------------------------------------------------------------------------------------------------------
-- НАСТРОЙКИ:
----------------------------------------------------------------------------------------------------------------------

	---------------------------------------
	-- Аккаунт
	---------------------------------------

	FILE_SETTINGS_TRADE_ACC							= "100100"; -- Торговый счет
	FILE_SETTINGS_CLIENT_CODE						= "SPBFUT100100"; -- Код клиента

	---------------------------------------
	-- Список торгуемых инструментов
	---------------------------------------
	
	FILE_SETTINGS_LIST_TICKETS = {
		{ "GZ", 40 }, -- 2 значение деф. стоп-лосс
		{ "VB", 40 }, -- 2 значение деф. стоп-лосс
		{ "FF", 100 }, -- 2 значение деф. стоп-лосс
		{ "RI", 400 }, -- 2 значение деф. стоп-лосс
		{ "Si", 50 }, -- 2 значение деф. стоп-лосс
		{ "SR", 60 }, -- 2 значение деф. стоп-лосс
		{ "SP", 60 }, -- 2 значение деф. стоп-лосс
		{ "BR", 100 }, -- 2 значение деф. стоп-лосс
	};

	---------------------------------------
	-- Для роботов (торговля по HTTP)
	---------------------------------------
	
	ROBOT_HTTP_URL = 'http://iv-litovchenko.ru/test.php'; -- url-адрес
	ROBOT_TIMEOUT = 10; -- интервал между запросами (в секундах)
	ROBOT_DO_FLAG = 1; -- выполнить скрипт робота

	---------------------------------------
	-- Риск-менеджмент (элементы)
	---------------------------------------
	
	-- TODO::В следующих версиях риск-менеджер будет переработан
	FILE_SETTINGS_LIST_RM = {
		{ "_QuikRM1", 2 }, 			-- Лимит потерь капитала на 1 день в "%" от депозита
		{ "_QuikRM2", 0.6 }, 		-- Лимит потерь в 1 сделке в "%" от депозита
		{ "_QuikRM3", 25 }, 		-- Максимальная загрузка депозита в % от депозита
		-- { "_QuikRM4", 0.2 }, 	-- Минимальный размер стопа в "%" от стоимости инструмента
		{ "_QuikRM5", 3 } 			-- Лимит транзакций в день (кол-во)
	};

	---------------------------------------
	-- Паттерны
	---------------------------------------
	
	FILE_SETTINGS_LIST_PATTERN = {
		"Паттерн №1",
		"Паттерн №2",
		"Паттерн №3"
	};



